Revit 2023 API
GroupTypeId.EnergyAnalysisBuildingData Property
 "Building Data"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisBuildingData { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisBuildingData As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisBuildingData {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace